tonchval2307/Codigos-Arduino/PIC16F877A-PIC18F4550/ARD_PIC16F877.X/Tonche_16F877.h
/* 
 * File:   Tonche_16F877.h
 * Author: Carlos-Tonche
 *
 * Created on February 28, 2018, 6:18 PM
 */

#ifndef TONCHE_16F877_H
#define	TONCHE_16F877_H

#ifdef	__cplusplus
extern "C" {
#endif




#ifdef	__cplusplus
}
#endif

#endif	/* TONCHE_16F877_H */
#include <xc.h>
#include <stdint.h>
// CONFIG
#pragma config FOSC = HS        // Oscillator Selection bits (XT oscillator)
#pragma config WDTE = OFF       // Watchdog Timer Enable bit (WDT disabled)
#pragma config PWRTE = OFF      // Power-up Timer Enable bit (PWRT disabled)
#pragma config CP = OFF         // FLASH Program Memory Code Protection bits (Code protection off)
#pragma config BOREN = OFF      // Brown-out Reset Enable bit (BOR disabled)
#pragma config LVP = OFF        // Low Voltage In-Circuit Serial Programming Enable bit (RB3 is digital I/O, HV on MCLR must be used for programming)
#pragma config CPD = OFF        // Data EE Memory Code Protection (Code Protection off)
#pragma config WRT = ON         // FLASH Program Memory Write Enable (Unprotected program memory may be written to by EECON control)

#define INPUT 'I'
#define OUTPUT 'O'
#define HIGH 'h'
#define LOW 'l'
#define PA 'A'
#define PB 'B'
#define PC 'C'
#define PD 'D'
#define PE 'E'
#define FALLING 'f'
#define RISING 'r'
void TxRxOcurredReset(void);
void SSPInterruptEnable(void);
void SSPInterruptDisable(void);
void spiCLKpolarity(char polarity);
int ADInterrupt(void);
void ADInterruptReset(void);
int usartRXint(void);
int usartTXint(void);
int SSPIFinterrupt(void);
int CCP1IFInterrupt(void);
void CCP1IFReset(void);
int TMR2IFInterrupt(void);
void TMR2FReset(void);
int TMR1Interrupt(void);
void TMR1IFReset(void);
void EEPROMwriteIntEn(int mode);
void BusCollisionEnable(int mode);
void CCP2InterruptEnable(int mode);
int EEPROMWriteFlag(void);
int BusCollisionFlag(void);
int CCP2Flag(void);
void EEPROMFlagReset(void);
void BusColisionReset(void);
void CCP2FlagReset(void);
void ExternalIntEnable(int mode);
void ExternalIntEnable(int mode);
void PortBChangeIntEnable(int mode);
int TMR0Overflow(void);
int ExternalInt(void);
void ExternalIntReset(void);
int PortBChangeInt(void);
void TMR0IntReset(void);
int TMR0Overflow(void);
void PortBChangeIntEnable(int mode);
void ExternalIntEnable(int mode);
void timer0IntEnable(int mode);
void PeripheralIntEnable(int mode);
void GlobalInterruptEnable(int mode);
int spiRead(void);
void ADPortConfiguration(const int config);
int spiBufferfull(void);
void spiSlavebegin(void);
void spiMasterbegin(void);
void tmr1Prescaler(int rate);
int timer1read(void);
void timerCounter1start(void);
void counter1begin(void);
void timer1begin(void);
void preventiveWDTtoTMR0(void);
void timerCounter0Prescaler(const int rate);
void timer0begin(void);
void counter0begin(char edge);
void digitalWrite(int pin, char port, char value);
void setup(void);
void loop(void);
void portaMode(int pin, char mode);
void portbMode(int pin, char mode);
void portcMode(int pin, char mode);
void portdMode(int pin, char mode);
void porteMode(int pin, char mode);
int digitalRead(int pin, char port);
void digitalWrite(int pin, char port, char value);
int main(void)
{
    setup();
    while(1)
    {
        loop();
    }
}
/*
 *  Paso 1:
 *      generar procedimientos para configurar a voluntad los pines de entrada
 *      y salida.
 * Paso 2:
 * Generar procedimientos para leer los estados de los pines de entrada y
 * y salida.
 *
 */
void portaMode(int pin, char mode)
{
    if(pin >= 6)
    {
        pin = 5;
        if((mode == 'I') || (mode == 'i'))
        {
            TRISAbits.TRISA5 = 1;
        }
        else if((mode == 'O')||(mode == 'o'))
        {
            TRISAbits.TRISA5 = 0;
        }
    }
    else
    {
        switch(pin)
        {
            case 0:
                if((mode == 'I') || (mode == 'i'))
                {
                    TRISAbits.TRISA0 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISAbits.TRISA0 = 0;
                }
                break;
            case 1:
                if((mode == 'I') || (mode == 'i'))
                {
                    TRISAbits.TRISA1 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISAbits.TRISA1 = 0;
                }
                break;
            case 2:
                if((mode == 'I') || (mode == 'i'))
                {
                    TRISAbits.TRISA2 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISAbits.TRISA2 = 0;
                }
                break;
            case 3:
                if((mode == 'I') || (mode == 'i'))
                {
                    TRISAbits.TRISA3 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISAbits.TRISA3 = 0;
                }
                break;
            case 4:
                if((mode == 'I') || (mode == 'i'))
                {
                    TRISAbits.TRISA4 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISAbits.TRISA4 = 0;
                }
                break;
            case 5:
                if((mode == 'I') || (mode == 'i'))
                {
                    TRISAbits.TRISA5 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISAbits.TRISA5 = 0;
                }
                break;
        }

    }
}
void portbMode(int pin, char mode)
{
    if(pin >= 8)
    {
      pin = 7;
      if((mode == 'I') || (mode == 'i'))
      {
            TRISBbits.TRISB7 = 1;
      }
      else if((mode == 'O')||(mode == 'o'))
      {
            TRISBbits.TRISB7 = 0;
      }
    }
    else
    {
        switch(pin)
        {
            case 0:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISBbits.TRISB0 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISBbits.TRISB0 = 0;
                }
                break;
            case 1:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISBbits.TRISB1 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISBbits.TRISB1 = 0;
                }
                break;
            case 2:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISBbits.TRISB2 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISBbits.TRISB2 = 0;
                }
                break;
            case 3:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISBbits.TRISB3 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISBbits.TRISB3 = 0;
                }
                break;
            case 4:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISBbits.TRISB4 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISBbits.TRISB4 = 0;
                }
                break;
            case 5:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISBbits.TRISB5 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISBbits.TRISB5 = 0;
                }
                break;
            case 6:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISBbits.TRISB6 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISBbits.TRISB6 = 0;
                }
                break;
            case 7:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISBbits.TRISB7 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISBbits.TRISB7 = 0;
                }
                break;
        }
    }
}
void portcMode(int pin, char mode)
{
    if(pin >= 8)
    {
        pin = 7;
        if((mode == 'I')||(mode == 'i'))
        {
            TRISCbits.TRISC7 = 1;
        }
        else if((mode == 'O')||(mode == 'o'))
        {
            TRISCbits.TRISC7 = 0;
        }
    }
    else
    {
        switch(pin)
        {
            case 0:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISCbits.TRISC0 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISCbits.TRISC0 = 0;
                }
                break;
            case 1:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISCbits.TRISC1 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISCbits.TRISC1 = 0;
                }
                break;
            case 2:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISCbits.TRISC2 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISCbits.TRISC2 = 0;
                }
                break;
            case 3:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISCbits.TRISC3 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISCbits.TRISC3 = 0;
                }
                break;
            case 4:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISCbits.TRISC4 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISCbits.TRISC4 = 0;
                }
                break;
            case 5:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISCbits.TRISC5 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISCbits.TRISC5 = 0;
                }
                break;
            case 6:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISCbits.TRISC6 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISCbits.TRISC6 = 0;
                }
                break;
            case 7:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISCbits.TRISC7 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISCbits.TRISC7 = 0;
                }
                break;
        }
    }
}
void portdMode(int pin, char mode)
{
    if(pin >= 8)
    {
        pin = 7;
        if((mode == 'I')||(mode == 'i'))
        {
            TRISCbits.TRISC7 = 1;
        }
        else if((mode == 'O')||(mode == 'o'))
        {
            TRISCbits.TRISC7 = 0;
        }
    }
    else
    {
        switch(pin)
        {
            case 0:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISCbits.TRISC0 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISCbits.TRISC0 = 0;
                }
                break;
            case 1:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISCbits.TRISC1 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISCbits.TRISC1 = 0;
                }
                break;
            case 2:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISCbits.TRISC2 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISCbits.TRISC2 = 0;
                }
                break;
            case 3:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISCbits.TRISC3 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISCbits.TRISC3 = 0;
                }
                break;
            case 4:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISCbits.TRISC4 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISCbits.TRISC4 = 0;
                }
                break;
            case 5:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISCbits.TRISC5 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISCbits.TRISC5 = 0;
                }
                break;
            case 6:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISCbits.TRISC6 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISCbits.TRISC6 = 0;
                }
                break;
            case 7:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISCbits.TRISC7 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISCbits.TRISC7 = 0;
                }
                break;
        }
    }
}
void porteMode(int pin, char mode)
{
    if(pin >= 3)
    {
        if((mode == 'I')||(mode == 'i'))
        {
            TRISEbits.TRISE2 = 1;
        }
        else if((mode == 'O')||(mode == 'o'))
        {
            TRISEbits.TRISE2 = 0;
        }
    }
    else
    {
        switch(pin)
        {
            case 0:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISEbits.TRISE0 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISEbits.TRISE0 = 0;
                }
                break;
            case 1:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISEbits.TRISE1 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISEbits.TRISE1 = 0;
                }
                break;
            case 2:
                if((mode == 'I')||(mode == 'i'))
                {
                    TRISEbits.TRISE2 = 1;
                }
                else if((mode == 'O')||(mode == 'o'))
                {
                    TRISEbits.TRISE2 = 0;
                }
                break;
        }
    }
}
int digitalRead(int pin, char port)
{
    if((port == 'A')||(port == 'a'))
    {
        if(pin >=6)
        {
            if(PORTAbits.RA5 == 1)
            {
                return 1;
            }
            else
            {
                return 0;
            }
        }
        else
        {
            switch(pin)
            {
                case 0:
                    if(PORTAbits.RA0 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 1:
                    if(PORTAbits.RA1 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 2:
                    if(PORTAbits.RA2 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 3:
                    if(PORTAbits.RA3 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 4:
                    if(PORTAbits.RA4 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 5:
                    if(PORTAbits.RA5 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
            }
        }
    }
    else if ((port == 'B')||(port == 'b'))
    {
        if(pin >= 8)
        {
            if(PORTBbits.RB7 == 1)
            {
                return 1;
            }
            else
            {
                return 0;
            }
        }
        else
        {
            switch(pin)
            {
                case 0:
                    if(PORTBbits.RB0 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 1:
                    if(PORTBbits.RB1 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 2:
                    if(PORTBbits.RB2 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 3:
                    if(PORTBbits.RB3 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 4:
                    if(PORTBbits.RB4 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 5:
                    if(PORTBbits.RB5 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 6:
                    if(PORTBbits.RB6 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 7:
                    if(PORTBbits.RB7 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
            }
        }
    }
    else if ((port == 'C')||(port == 'c'))
    {
        if(pin >= 8)
        {
            if(PORTCbits.RC7 == 1)
            {
                return 1;
            }
            else
            {
                return 0;
            }
        }
        else
        {
            switch(pin)
            {
                case 0:
                    if(PORTCbits.RC0 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 1:
                    if(PORTCbits.RC1 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 2:
                    if(PORTCbits.RC2 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 3:
                    if(PORTCbits.RC3 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 4:
                    if(PORTCbits.RC4 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 5:
                    if(PORTCbits.RC5 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 6:
                    if(PORTCbits.RC6 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 7:
                    if(PORTCbits.RC7 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
            }
        }
    }
    else if ((port == 'D')||(port == 'd'))
    {
        if(pin >= 8)
        {
            if(PORTDbits.RD7 == 1)
            {
                return 1;
            }
            else
            {
                return 0;
            }
        }
        else
        {
            switch(pin)
            {
                case 0:
                    if(PORTDbits.RD0 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 1:
                    if(PORTDbits.RD1 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 2:
                    if(PORTDbits.RD2 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 3:
                    if(PORTDbits.RD3 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 4:
                    if(PORTDbits.RD4 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 5:
                    if(PORTDbits.RD5 == 1)
                    {
                        return 1;
                    }
