tonchval2307/Codigos-Arduino/PIC16F877A-PIC18F4550/ARD_PIC16F877.X/Tonche_16F877.h
                    else
                    {
                        return 0;
                    }
                    break;
                case 6:
                    if(PORTDbits.RD6 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 7:
                    if(PORTDbits.RD7 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
            }
        }
    }
    else if ((port == 'E')||(port == 'e'))
    {
        if(pin >= 3)
        {
            if(PORTEbits.RE2 == 1)
            {
                return 1;
            }
            else
            {
                return 0;
            }
        }
        else
        {
            switch(pin)
            {
                case 0:
                    if(PORTEbits.RE0 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 1:
                    if(PORTEbits.RE1 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
                case 2:
                    if(PORTEbits.RE2 == 1)
                    {
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                    break;
            }
        }
    }
}
void digitalWrite(int pin, char port, char value)
{
    switch(port)
    {
        case 'A':
            switch(pin)
            {
                case 0:
                    if(value == 'h')
                    {
                        PORTAbits.RA0 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTAbits.RA0 = 0;
                    }
                    break;
                case 1:
                    if(value == 'h')
                    {
                        PORTAbits.RA1 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTAbits.RA1 = 0;
                    }
                    break;
                case 2:
                    if(value == 'h')
                    {
                        PORTAbits.RA2 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTAbits.RA2 = 0;
                    }
                    break;
                case 3:
                    if(value == 'h')
                    {
                        PORTAbits.RA3 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTAbits.RA3 = 0;
                    }
                    break;
                case 4:
                    if(value == 'h')
                    {
                        PORTAbits.RA4 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTAbits.RA4 = 0;
                    }
                    break;
                case 5:
                    if(value == 'h')
                    {
                        PORTAbits.RA5 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTAbits.RA5 = 0;
                    }
                    break;
            }
            break;
        case 'B':
            switch(pin)
            {
                case 0:
                    if(value == 'h')
                    {
                        PORTBbits.RB0 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTBbits.RB0 = 0;
                    }
                    break;
                case 1:
                    if(value == 'h')
                    {
                        PORTBbits.RB1 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTBbits.RB1 = 0;
                    }
                    break;
                case 2:
                    if(value == 'h')
                    {
                        PORTBbits.RB2 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTBbits.RB2 = 0;
                    }
                    break;
                case 3:
                    if(value == 'h')
                    {
                        PORTBbits.RB3 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTBbits.RB3 = 0;
                    }
                    break;
                case 4:
                    if(value == 'h')
                    {
                        PORTBbits.RB4 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTBbits.RB4 = 0;
                    }
                    break;
                case 5:
                    if(value == 'h')
                    {
                        PORTBbits.RB5 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTBbits.RB5 = 0;
                    }
                    break;
                case 6:
                    if(value == 'h')
                    {
                        PORTBbits.RB6 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTBbits.RB6 = 0;
                    }
                    break;
                case 7:
                    if(value == 'h')
                    {
                        PORTBbits.RB7 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTBbits.RB7 = 0;
                    }
                    break;
            }
            break;
        case 'C':
            switch(pin)
            {
              case 0:
                    if(value == 'h')
                    {
                        PORTCbits.RC0 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTCbits.RC0 = 0;
                    }
                    break;
                case 1:
                    if(value == 'h')
                    {
                        PORTCbits.RC1 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTCbits.RC1 = 0;
                    }
                    break;
                case 2:
                    if(value == 'h')
                    {
                        PORTCbits.RC2 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTCbits.RC2 = 0;
                    }
                    break;
                case 3:
                    if(value == 'h')
                    {
                        PORTCbits.RC3 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTCbits.RC3 = 0;
                    }
                    break;
                case 4:
                    if(value == 'h')
                    {
                        PORTCbits.RC4 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTCbits.RC4 = 0;
                    }
                    break;
                case 5:
                    if(value == 'h')
                    {
                        PORTCbits.RC5 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTCbits.RC5 = 0;
                    }
                    break;
                case 6:
                    if(value == 'h')
                    {
                        PORTCbits.RC6 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTCbits.RC6 = 0;
                    }
                    break;
                case 7:
                    if(value == 'h')
                    {
                        PORTCbits.RC7 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTCbits.RC7 = 0;
                    }
                    break;
            }
            break;
        case 'D':
            switch(pin)
            {
                case 0:
                    if(value == 'h')
                    {
                        PORTDbits.RD0 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTDbits.RD0 = 0;
                    }
                    break;
                case 1:
                    if(value == 'h')
                    {
                        PORTDbits.RD1 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTDbits.RD1 = 0;
                    }
                    break;
                case 2:
                    if(value == 'h')
                    {
                        PORTDbits.RD2 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTDbits.RD2 = 0;
                    }
                    break;
                case 3:
                    if(value == 'h')
                    {
                        PORTDbits.RD3 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTDbits.RD3 = 0;
                    }
                    break;
                case 4:
                    if(value == 'h')
                    {
                        PORTDbits.RD4 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTDbits.RD4 = 0;
                    }
                    break;
                case 5:
                    if(value == 'h')
                    {
                        PORTDbits.RD5 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTDbits.RD5 = 0;
                    }
                    break;
                case 6:
                    if(value == 'h')
                    {
                        PORTDbits.RD6 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTDbits.RD6 = 0;
                    }
                    break;
                case 7:
                    if(value == 'h')
                    {
                        PORTDbits.RD7 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTDbits.RD7 = 0;
                    }
                    break;
            }
            break;
        case 'E':
            switch(pin)
            {
                case 0:
                    if(value == 'h')
                    {
                        PORTEbits.RE0 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTEbits.RE0 = 0;
                    }
                    break;
                case 1:
                    if(value == 'h')
                    {
                        PORTEbits.RE1 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTEbits.RE1 = 0;
                    }
                    break;
                case 2:
                    if(value == 'h')
                    {
                        PORTEbits.RE2 = 1;
                    }
                    else if(value == 'l')
                    {
                        PORTEbits.RE2 = 0;
                    }
                    break;
            }
            break;
    }
}
/*
 *  Timer 0 Module
 */
void timer0begin(void)
{
    preventiveWDTtoTMR0();
    OPTION_REGbits.T0CS = 0;
    OPTION_REGbits.PSA = 0;
}
void counter0begin(char edge)
{
    preventiveWDTtoTMR0();
    OPTION_REGbits.T0CS = 1;
    OPTION_REGbits.PSA = 0;
    switch(edge)
    {
        case 'r':
            OPTION_REGbits.T0SE = 0;
            break;
        case 'f':
            OPTION_REGbits.T0SE = 1;
            break;
    }
}
void timerCounter0Prescaler(const int rate)
{
    switch(rate)
    {
        case 2:
            OPTION_REGbits.PS2 = 0;
            OPTION_REGbits.PS1 = 0;
            OPTION_REGbits.PS0 = 0;
            break;
        case 4:
            OPTION_REGbits.PS2 = 0;
            OPTION_REGbits.PS1 = 0;
            OPTION_REGbits.PS0 = 1;
            break;
        case 8:
            OPTION_REGbits.PS2 = 0;
            OPTION_REGbits.PS1 = 1;
            OPTION_REGbits.PS0 = 0;
            break;
        case 16:
            OPTION_REGbits.PS2 = 0;
            OPTION_REGbits.PS1 = 1;
            OPTION_REGbits.PS0 = 1;
            break;
        case 32:
            OPTION_REGbits.PS2 = 1;
            OPTION_REGbits.PS1 = 0;
            OPTION_REGbits.PS0 = 0;
            break;
        case 64:
            OPTION_REGbits.PS2 = 1;
            OPTION_REGbits.PS1 = 0;
            OPTION_REGbits.PS0 = 1;
            break;
        case 128:
            OPTION_REGbits.PS2 = 1;
            OPTION_REGbits.PS1 = 1;
            OPTION_REGbits.PS0 = 0;
            break;
        case 256:
            OPTION_REGbits.PS2 = 1;
            OPTION_REGbits.PS1 = 1;
            OPTION_REGbits.PS0 = 1;
            break;
    }
}
void preventiveWDTtoTMR0(void)
{
    //To Change the prescaler from TMR0 to WDT
    asm("BSF    STATUS, RP0");
    asm("MOVLW  b'xx0x0xxx'");
    asm("MOVWF  OPTION_REG");
    asm("BCF    STATUS, RP0");
    asm("CLRF   TMR0");
    asm("BSF    STATUS, RP1");
    asm("MOVLW  b'xxxx1xxx'");
    asm("MOVWF  OPTION_REG");
    asm("BCF    STATUS, RP0");
    //To Change Prescaler from WDT to TMR0
    asm("CLRWDT ");
    asm("BSF    STATUS, RP0");
    asm("MOVLW  b'xxxx0xxx'");
    asm("MOVWF  OPTION_REG");
    asm("BCF    STATUS, RP0");
}
/*
 * Timer 1
 */
void timer1begin(void)
{
    T1CONbits.TMR1CS = 0;
}
void counter1begin(void)
{
    T1CONbits.TMR1CS = 1;
}
void timerCounter1start(void)
{
    T1CONbits.TMR1ON = 1;
}
int timer1read(void)
{
    int T1H = 0;
    int T1L = 0;
    T1H = TMR1H;
    T1L = TMR1L;
    return T1H + T1L;
}
void tmr1Prescaler(int rate)
{
    switch(rate)
    {
        case 8:
            T1CONbits.T1CKPS1 = 1;
            T1CONbits.T1CKPS0 = 1;
            break;
        case 4:
            T1CONbits.T1CKPS1 = 1;
            T1CONbits.T1CKPS0 = 0;
            break;
        case 2:
            T1CONbits.T1CKPS1 = 0;
            T1CONbits.T1CKPS0 = 1;
            break;
        case 1:
            T1CONbits.T1CKPS1 = 0;
            T1CONbits.T1CKPS0 = 0;
            break;
    }
}

/**
 * SPI Module
 **/
int spiRead(void)
{
    return SSPBUF;
}
void spiSlavebegin(void)
{
    ADPortConfiguration(14);
    SSPSTATbits.SMP = 0;
    SSPCONbits.SSPEN = 1;
    TRISCbits.TRISC3 = 1;  //Serial Clock
    TRISCbits.TRISC4 = 1;   //Seral Data Input MOSI
    TRISCbits.TRISC5 = 0;   //Serial Data Out MISO
    TRISAbits.TRISA5 = 1;
    SSPCONbits.SSPM3 = 0;
    SSPCONbits.SSPM2 = 1;
    SSPCONbits.SSPM1 = 0;
    SSPCONbits.SSPM0 = 0;

