tonchval2307/Codigos-Arduino/PIC16F877A-PIC18F4550/ARD_PIC16F877.X/Tonche_16F877.h
}
void ADPortConfiguration(const int config)
{
    switch(config)
    {
        case 0:
            ADCON1bits.PCFG3 = 0;
            ADCON1bits.PCFG2 = 0;
            ADCON1bits.PCFG1 = 0;
            ADCON1bits.PCFG0 = 0;
            break;
        case 1:
            ADCON1bits.PCFG3 = 0;
            ADCON1bits.PCFG2 = 0;
            ADCON1bits.PCFG1 = 0;
            ADCON1bits.PCFG0 = 1;
            break;
        case 2:
            ADCON1bits.PCFG3 = 0;
            ADCON1bits.PCFG2 = 0;
            ADCON1bits.PCFG1 = 1;
            ADCON1bits.PCFG0 = 0;
            break;
        case 3:
            ADCON1bits.PCFG3 = 0;
            ADCON1bits.PCFG2 = 0;
            ADCON1bits.PCFG1 = 1;
            ADCON1bits.PCFG0 = 1;
            break;
        case 4:
            ADCON1bits.PCFG3 = 0;
            ADCON1bits.PCFG2 = 1;
            ADCON1bits.PCFG1 = 0;
            ADCON1bits.PCFG0 = 0;
            break;
        case 5:
            ADCON1bits.PCFG3 = 0;
            ADCON1bits.PCFG2 = 1;
            ADCON1bits.PCFG1 = 0;
            ADCON1bits.PCFG0 = 1;
            break;
        case 6:
            ADCON1bits.PCFG3 = 0;
            ADCON1bits.PCFG2 = 1;
            ADCON1bits.PCFG1 = 1;
            ADCON1bits.PCFG0 = 0;
            break;
        case 7:
            ADCON1bits.PCFG3 = 1;
            ADCON1bits.PCFG2 = 0;
            ADCON1bits.PCFG1 = 0;
            ADCON1bits.PCFG0 = 0;
            break;
        case 8:
            ADCON1bits.PCFG3 = 1;
            ADCON1bits.PCFG2 = 0;
            ADCON1bits.PCFG1 = 0;
            ADCON1bits.PCFG0 = 1;
            break;
        case 9:
            ADCON1bits.PCFG3 = 1;
            ADCON1bits.PCFG2 = 0;
            ADCON1bits.PCFG1 = 1;
            ADCON1bits.PCFG0 = 0;
            break;
        case 10:
            ADCON1bits.PCFG3 = 1;
            ADCON1bits.PCFG2 = 0;
            ADCON1bits.PCFG1 = 1;
            ADCON1bits.PCFG0 = 1;
            break;
        case 11:
            ADCON1bits.PCFG3 = 1;
            ADCON1bits.PCFG2 = 1;
            ADCON1bits.PCFG1 = 0;
            ADCON1bits.PCFG0 = 0;
            break;
        case 12:
            ADCON1bits.PCFG3 = 1;
            ADCON1bits.PCFG2 = 1;
            ADCON1bits.PCFG1 = 0;
            ADCON1bits.PCFG0 = 1;
            break;
        case 13:
            ADCON1bits.PCFG3 = 1;
            ADCON1bits.PCFG2 = 1;
            ADCON1bits.PCFG1 = 1;
            ADCON1bits.PCFG0 = 0;
            break;
        case 14:
            ADCON1bits.PCFG3 = 1;
            ADCON1bits.PCFG2 = 1;
            ADCON1bits.PCFG1 = 1;
            ADCON1bits.PCFG0 = 1;
            break;
        default:
            ADCON1bits.PCFG3 = 0;
            ADCON1bits.PCFG2 = 0;
            ADCON1bits.PCFG1 = 0;
            ADCON1bits.PCFG0 = 0;
            break;
    }
}
void spiCLKpolarity(char polarity)
{
    if(polarity == 'h')
    {
        SSPCONbits.CKP = 1;
    }
    else if(polarity == 'l')
    {
        SSPCONbits.CKP = 0;
    }
}
int spiBufferfull(void)
{
    return SSPSTATbits.BF;
}
int spiOverflow(void)
{
    return SSPCONbits.SSPOV;
}
void spiMasterbegin(void)
{

}
/*
 * Interruption
 */
void GlobalInterruptEnable(int mode)
{
    if(mode == 1)
    {
        INTCONbits.GIE = 1;
    }
    else
    {
        INTCONbits.GIE = 0;
    }
}
void PeripheralIntEnable(int mode)
{
   if(mode == 1)
    {
        INTCONbits.PEIE = 1;
    }
    else
    {
        INTCONbits.PEIE = 0;
    }
}
void timer0IntEnable(int mode)
{
    if(mode == 1)
    {
        INTCONbits.T0IE = 1;
    }
    else
    {
        INTCONbits.T0IE = 0;
    }
}
void ExternalIntEnable(int mode)
{
    if(mode == 1)
    {
        INTCONbits.INTE = 1;
    }
    else
    {
        INTCONbits.INTE = 0;
    }
}
void PortBChangeIntEnable(int mode)
{
    if(mode == 1)
    {
        INTCONbits.RBIE = 1;
    }
    else
    {
        INTCONbits.RBIE = 0;
    }
}
int TMR0Overflow(void)
{
    if(INTCONbits.T0IF == 1)
    {
        return 1;
    }
    else
    {
        return 0;
    }
}
void TMR0IntReset(void)
{
  INTCONbits.T0IF = 0;
}
int ExternalInt(void)
{
    if(INTCONbits.INTF == 1)
    {
        return 1;
    }
    else
    {
        return 0;
    }
}
void ExternalIntReset(void)
{
    INTCONbits.INTF = 0;
}
int PortBChangeInt(void)
{
    if(INTCONbits.RBIF == 1)
    {
        return 1;
    }
    else
    {
        return 0;
    }
}
void PeriheralEnable(char peripheral, int mode)
{
    switch(peripheral)
    {
        case 'p':
            if(mode == 1)
            {
               PIE1bits.PSPIE = 0;
            }
            else if(mode == 0)
            {
                PIE1bits.PSPIE = 0;
            }
            else
            {
               PIE1bits.PSPIE = 0;
            }
            break;
        case 'a':
            if(mode == 1)
            {
               PIE1bits.ADIE = 1;
            }
            else if(mode == 0)
            {
                PIE1bits.ADIE = 0;
            }
            else
            {
               PIE1bits.ADIE = 0;
            }
            break;
        case 'r':
            if(mode == 1)
            {
               PIE1bits.RCIE = 1;
            }
            else if(mode == 0)
            {
                PIE1bits.RCIE = 0;
            }
            else
            {
               PIE1bits.RCIE = 0;
            }
            break;
        case 't':
            if(mode == 1)
            {
               PIE1bits.TXIE = 1;
            }
            else if(mode == 0)
            {
                PIE1bits.TXIE = 0;
            }
            else
            {
               PIE1bits.TXIE = 0;
            }
            break;
        case 's':
            if(mode == 1)
            {
               PIE1bits.SSPIE = 1;
            }
            else if(mode == 0)
            {
                PIE1bits.SSPIE = 0;
            }
            else
            {
               PIE1bits.SSPIE = 0;
            }
            break;
        case 'c':
            if(mode == 1)
            {
               PIE1bits.CCP1IE = 1;
            }
            else if(mode == 0)
            {
                PIE1bits.CCP1IE = 0;
            }
            else
            {
               PIE1bits.CCP1IE = 0;
            }
            break;
        case 'd':
            if(mode == 1)
            {
               PIE1bits.TMR2IE = 1;
            }
            else if(mode == 0)
            {
                PIE1bits.TMR2IE = 0;
            }
            else
            {
               PIE1bits.TMR2IE = 0;
            }
            break;
        case 'f':
            if(mode == 1)
            {
               PIE1bits.TMR1IE = 1;
            }
            else if(mode == 0)
            {
                PIE1bits.TMR1IE = 0;
            }
            else
            {
               PIE1bits.TMR1IE = 0;
            }
            break;
    }
}
int ADInterrupt(void)
{
   if(PIR1bits.ADIF == 1)
   {
       return 1;
   }
   else
   {
       return 0;
   }
}
void ADInterruptReset(void)
{
    PIR1bits.ADIF = 0;
}
int usartRXint(void)
{
    return PIR1bits.RCIF;
}
int usartTXint(void)
{
    return PIR1bits.TXIF;
}
int SSPIFinterrupt(void)
{
    return PIR1bits.SSPIF;
}
void TxRxOcurredReset(void)
{
    PIR1bits.SSPIF = 0;
}
int CCP1IFInterrupt(void)
{
    return PIR1bits.CCP1IF;
}
void CCP1IFReset(void)
{
    PIR1bits.CCP1IF = 0;
}
int TMR2IFInterrupt(void)
{
    return PIR1bits.TMR2IF;
}
void TMR2FReset(void)
{
    PIR1bits.TMR2IF = 0;
}
int TMR1Interrupt(void)
{
    return PIR1bits.TMR1IF;
}
void TMR1IFReset(void)
{
    PIR1bits.TMR1IF = 0;
}
void EEPROMwriteIntEn(int mode)
{
    if(mode == 1)
    {
       PIE2bits.EEIE = 1;
    }
    else
    {
        PIE2bits.EEIE = 0;
    }
}
void BusCollisionEnable(int mode)
{
    if(mode == 1)
    {
      PIE2bits.BCLIE = 1;
    }
    else
    {
      PIE2bits.BCLIE = 0;
    }
}
void CCP2InterruptEnable(int mode)
{
    if(mode == 1)
    {
        PIE2bits.CCP2IE = 1;
    }
    else
    {
        PIE2bits.CCP2IE = 0;
    }
}
int EEPROMWriteFlag(void)
{
    return PIR2bits.EEIF;
}
int BusCollisionFlag(void)
{
    return PIR2bits.BCLIF;
}
int CCP2Flag(void)
{
    return PIR2bits.CCP2IF;
}
void EEPROMFlagReset(void)
{
    PIR2bits.EEIF = 0;
}
void BusColisionReset(void)
{
    PIR2bits.BCLIF = 0;
}
void CCP2FlagReset(void)
{
    PIR2bits.CCP2IF = 0;
}
void SSPInterruptEnable(void)
{
    PIE1bits.SSPIE = 1;
}
void SSPInterruptDisable(void)
{
    PIE1bits.SSPIE = 0;
}